{"_ch01_0": ["What is the definition of signals?", "Give me some examples of signals.", "Give me a common example of signals.", "Give me an example of one dimensional signals.", "What is a speech signal?", "Give me a two dimensional signal example.", "What is an image signal?", "How can we define the independent variable in continuous time signals?", "How can we define the independent variable in discrete time signals?", "How do we categorize signals based on the underlying variable?", "How can we convert a continuous time signal into a discrete time signal?", "How do we represent independent variable in continuous time signals?", "How do we represent independent variable in discrete time signals?", "Can you give me a system example?", "Give me a system example.", "Is electrical circuit a system?", "What are systems?", "What is a continuous time system?", "What is a discrete time system?"], "_ch01_1": ["What happens when n zero is greater than zero when applying time shift to a discrete time signal?", "What happens when n zero is less than zero when applying time shift to a discrete time signal?", "How can we obtain a time reversed discrete time signal?", "How can we obtain a time reversed continuous time signal?", "What happens when we apply time reversal to an audio tape recording?", "What happens when we apply time scaling to an audio tape recording?", "What happens to the original signal x of t while transforming it into x of alpha t plus beta if the absolute value of alpha is greater than one?", "What happens to the original signal x of t while transforming it into x of alpha t plus beta if the absolute value of alpha is less than one?", "What happens to the original signal x of t while transforming it into x of alpha t plus beta if the absolute value of alpha is negative?", "What should be the order of operations if more than one transformations are applied to a signal?", "What is fundamental period?", "What is the property that periodic signals should hold?", "What is an even signal?", "What is an odd signal?"], "_ch01_2": ["Which signals are the basic building blocks of other signals?", "What is a continuous time decaying exponential signal?", "What is a continuous time growing exponential signal?", "What is a continuous time real exponential signal?", "What is the mathematical expression for a continuous time complex exponential signal?", "How can we understand if a continuous time signal is periodic?", "What is a continuous time complex exponential signal?", "What is the fundamental period of a continuous time complex exponential signal?", "How can we represent a continuous time sinusoidal signal mathematically?", "What are the units for the frequency and phase?", "What is the fundamental period of a continuous time sinusoidal signal?", "Give me an example continuous time signal with infinite total energy and finite average power.", "What is the average power of a continuous time complex exponential signal in one period?", "What is the energy of a continuous time complex exponential signal in one period?", "What is the total energy of a continuous time complex exponential signal?"], "_ch01_3": ["How can we define a discrete time complex exponential signal mathematically?", "What is a discrete time real exponential signal?", "How can we represent a discrete time complex exponential signal in general form?", "How does the fundamental frequency differ in continuous time and discrete time complex exponential signals?", "How does the periodicity property differ in continuous time and discrete time complex exponential signals?", "What happens when we increase omega zero in continuous time complex exponentials?", "What happens when we increase omega zero in discrete time complex exponentials?"], "_ch01_4": ["How can we define discrete time unit impulse function?", "Why is the discrete time unit impulse function important?", "How are discrete time unit impulse and unit step functions related with each other?", "State one usage of discrete time unit impulse function.", "How are continuous time unit step and unit impulse functions related with each other?", "State one usage of continuous time unit impulse function."], "_ch01_5": ["What is a continuous time system?", "What is a discrete time system?", "What is a memoryless system?", "What happens when we cascade a system with its inverse system?", "What is an invertible system?", "What is a causal system?", "How can we analyze if a system is stable?", "What is a stable system?", "What is a time invariant system?", "What are the two properties that a linear system must hold?", "What is a linear system?", "Why do time invariance and linearity properties have great importance?"], "_ch02_2": ["How are the characteristics of linear time invariant systems determined?", "How can we obtain the response of a linear time invariant system?", "How can we understand if a systems is memoryless from its input output relation?", "What is the impulse response of a memoryless linear time invariant system?", "What happens when we convolve the impulse response of a linear time invariant system with its inverse?", "How can we understand if a system is causal from its input output relation?", "How can we understand if a system is stable from its input output relation?"], "_ch03_1": ["How did we develop the analysis of linear time invariant systems through convolution?", "How do we represent signals in fourier analysis?", "Why do we use complex exponentials in fourier analysis?", "What happens when we apply a complex exponential as input to a linear time invariant system?", "What is eigen function of a system?", "What is eigen function property?", "What is eigen value?", "What happens when we apply the linear combination of complex exponentials as input to a linear time invariant system?"], "_ch03_2": ["What is fourier series representation?", "How can we compute the fourier series coefficients?", "How broad class of signals can be represented using fourier series representation?", "What is the condition that guarantees the existence of fourier series representation of a continuous time signal?", "State the dirichlet conditions.", "What do the dirichlet conditions guarantee?"], "_ch03_4": ["Are there any convergence issues in discrete time fourier series?", "What is the difference between continuous time and discrete time fourier series coefficients?", "What is the difference between the continuous time and discrete time fourier series representations?", "Why do we have only n distinct harmonically related discrete time complex exponentials?", "How can we define discrete time fourier series representation?", "How can we compute the discrete time fourier series coefficients?", "Why are the discrete time fourier series coefficients periodic?", "Are there any convergence issues in discrete time fourier series representation?", "How can we compute the fourier series coefficients of multiplied signals?", "What is the parsevals relation for discrete time fourier series?"], "_ch04_1": ["How can we develop fourier transform representation for aperiodic signals using fourier series representation?", "How can we represent a continuous time periodic signal with fourier series?", "What happens to the fourier series coefficients when we increase the period of the periodic signal?", "How can we derive the mathematical formulation of the fourier transform from fourier series representation?", "State the condition that guarantees the existence of the fourier transform.", "Can we use dirichlet conditions to guarantee the existence of the fourier transform?", "How can we compute the fourier transform of continuous time periodic signals?"], "_ch05_1": ["How can we develop the discrete time fourier transform from fourier series representation?", "How can we derive the mathematical formulation of discrete time fourier transform from fourier series equations?", "Are there any convergence issues with the inverse discrete time fourier transform?", "When does discrete time fourier transform equation converge?", "How can we compute the fourier transform of discrete time periodic signals?", "What is multiplication property of discrete time fourier transform?", "What is periodicity property of discrete time fourier transform?", "What is time expansion property of discrete time fourier transform?", "Why is the relation between time and frequency scaling different in discrete time and continuous time fourier transforms?"], "_ch07_1": ["What is reconstruction?", "What is sampling?", "Explain discrete time processing of continuous time signals.", "What is the main usage of continuous time sampling?", "Why do we sample discrete time signals?", "What is sampling theorem?", "When do the samples of a signal uniquely specify that signal?", "How can we obtain the sampled signal from a continuous time signal?", "How can we take equally spaced samples from a continuous time signal?", "How can we obtain the spectrum of the sampled signal?", "How can we recover the original signal from the sampled signal?", "How do we choose the gain and the cut off frequency of the low pass filter used in reconstruction?", "What is nyquistrate?", "What is the condition required in the sampling theorem?", "What is the fourier transform of a periodic impulse train?", "What is aliasing?"], "_ch09_1": ["What is laplace transform?", "What happens when s is purely imaginary in the laplace transform equation?", "What is the mathematical expression for the laplace transform?", "What is the relationship between fourier transform and laplace transform?", "When does the fourier transform equation converges?", "How can we check if the laplace transform of a given signal exists?", "What is region of convergence?", "Why do we need the laplace transform in analyzing signals and systems in addition to fourier transform?", "What is the superiority of the laplace transform compared to the fourier transform?", "How can we determine the existence of the fourier transform of a signal by looking at the roc plot?", "Does growing exponential signal have fourier transform?", "Does the roc of a growing exponential signal include the imaginary axis?", "How can we distinguish time domain signals from identical laplace transform expressions?", "Does laplace transform converge for all values of s?", "How can we check the existence of the fourier transform for continuous time signals?", "How do we determine the region of convergence from s?", "What is the definition of region of convergence?", "How can we check the existence of the fourier transform of a signal from the roc of laplace transform?", "How can we obtain the fourier transform of a continuous time signal signal from its laplace transform?", "Why do we need to specify the roc in the laplace transfrom expression?"], "_ch09_2": ["How can we interpret poles?", "How can we interpret zeros?", "How do we define the poles of a rational laplace transform?", "How do we define the zeros of a rational laplace transform?", "When do we have poles and zeros at infinity?", "How do we mark poles and zeros in roc plot?", "How do we represent repeated zeros in roc plot?", "Can the roc contain any poles?", "Does the laplace transform converge at a pole?", "Why does the roc contain strips parallel to the j omega axis?", "When does the roc of a laplace transform contain the entire s plane?", "How can we determine the roc for a right sided time domain signal?", "What is a right half plane?", "How can we determine the roc for a left sided time domain signal?", "What is a left half plane?", "When does the roc contain a single strip in the s plane?", "How can we determine the roc for a rational laplace transform?", "For rational laplace transforms how can we determine the roc for left sided time domain signals?", "For rational laplace transforms how can we determine the roc for right sided time domain signals?"]}